Revit 2026 API

# ExportTextQualifier Enumeration

---

Options for the text qualifier character in schedule view export.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ExportTextQualifier
```
```vb
Public Enumeration ExportTextQualifier
```
```cpp
public enum class ExportTextQualifier
```
```fsharp
type ExportTextQualifier
```

| Member name | Value | Description |
| --- | --- | --- |
| DoubleQuote | 2 | The quote character - " - is used to qualify text. |
| None | 0 | No text qualifier. |
| Quote | 1 | The quote character - ' - is used to qualify text. |

#### Reference

Autodesk.Revit.DB Namespace